var faq_data = {
		/**
	 * 0 : id, int, 主键
	 * 1 : order, int, 顺序
	 * 2 : question, varchar, 问题
	 * 3 : answer, varchar, 回答 
	 */

	Id : 0,
	Order : 1,
	Question : 2,
	Answer : 3,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[3 /*[0]*/, 1 /*[1]*/, "如何充值游戏仙尊？有多少个仙尊等级？" /*[2]*/, "通过“仙尊”系统可进行充值，游戏中仙尊最高为15阶" /*[3]*/],
		[4 /*[0]*/, 2 /*[1]*/, "在哪里可以查看游戏活动？" /*[2]*/, "玩家通过“活动中心”可及时查阅到每天游戏中的所有活动情况。也可以通过《仙侠道》官网了解最新的活动资讯" /*[3]*/],
		[5 /*[0]*/, 3 /*[1]*/, "体力恢复时间为多久？怎样购买体力？" /*[2]*/, "每5分钟恢复1点体力，通过元宝购买每次可以获得100点体力" /*[3]*/],
		[9 /*[0]*/, 4 /*[1]*/, "如何开启新副本地图？" /*[2]*/, "可以通过支线任务提升等级开启新副本地图" /*[3]*/],
		[6 /*[0]*/, 5 /*[1]*/, "深渊玩法介绍？怎样进入深渊？深渊副本有什么奖励？" /*[2]*/, "每个城镇地下都会有对应的深渊关卡，通过深渊关卡是获得紫色装备的主要途径" /*[3]*/],
		[7 /*[0]*/, 6 /*[1]*/, "如在打副本（深渊）中掉线，上线后会出现在哪个地图？体力是否扣完？" /*[2]*/, "如果在关卡进行中掉线，则重新登入还是会在当前关卡中，并且不扣体力" /*[3]*/],
		[8 /*[0]*/, 7 /*[1]*/, "如何强化、重铸装备？装备品质情况怎么分？可以怎么获得高品质装备？" /*[2]*/, "点击“装备”就会看到对应选项。目前版本中装备品质分为橙>金〉紫〉蓝。玩家通过深渊关卡或参与活动将有机会获得高品质装备。" /*[3]*/],
		[10 /*[0]*/, 8 /*[1]*/, "为什么我等级和他一样高，他的攻击力却比我高很多？" /*[2]*/, "游戏中除了等级之外，玩家还可以通过“装备精练、重置、魂侍培养”等其他系统玩法提高攻击属性" /*[3]*/],
		[11 /*[0]*/, 9 /*[1]*/, "铜钱的作用是什么？怎么获得铜钱？" /*[2]*/, "铜钱游戏中最主要的货币之一，玩家可以通过副本掉落及开元通宝获得铜钱。除此之外游戏中大量活动也是玩家收货铜钱的有效途径" /*[3]*/],
		[12 /*[0]*/, 10 /*[1]*/, "魂侍如何收集、升级、进阶？游戏中怎样触发魂侍技能？" /*[2]*/, "彩虹桥是魂侍收集的主要渠道，玩家也可以通过“命锁”花费元宝进行抽取。游戏中，玩家通过积累魂力从而出发魂侍技能" /*[3]*/],
		[13 /*[0]*/, 11 /*[1]*/, "灵宠是什么？怎么获得？用法是什么？" /*[2]*/, "灵宠是游戏中伴随玩家一起斩妖除魔的主要战力之一，玩家在部分关卡中会有几率抓捕到各式各样的灵宠。战斗中需要消耗精气才能召唤灵宠协助战斗哦！" /*[3]*/]
	],
};
