var login_award_data = {
		/**
	 * 0 : id, int, 奖励ID
	 * 1 : requrie_active_days, int, 累计活跃天数
	 * 2 : award_type, tinyint, 奖励类型
	 * 3 : award_id, int, 奖励内容外键
	 * 4 : award_num, int, 奖励数量 
	 */

	Id : 0,
	Requrie_active_days : 1,
	Award_type : 2,
	Award_id : 3,
	Award_num : 4,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[1 /*[0]*/, 1 /*[1]*/, 4 /*[2]*/, 0 /*[3]*/, 200 /*[4]*/],
		[2 /*[0]*/, 2 /*[1]*/, 1 /*[2]*/, 305 /*[3]*/, 4 /*[4]*/],
		[3 /*[0]*/, 3 /*[1]*/, 1 /*[2]*/, 341 /*[3]*/, 1 /*[4]*/],
		[4 /*[0]*/, 3 /*[1]*/, 1 /*[2]*/, 232 /*[3]*/, 50 /*[4]*/],
		[5 /*[0]*/, 4 /*[1]*/, 1 /*[2]*/, 277 /*[3]*/, 10 /*[4]*/],
		[8 /*[0]*/, 5 /*[1]*/, 1 /*[2]*/, 401 /*[3]*/, 1 /*[4]*/]
	],
};
