var mission_talk_data = {
		/**
	 * 0 : id, int, 对话ID
	 * 1 : enemy_id, int, 副本敌人ID
	 * 2 : content, varchar, 对话内容
	 * 3 : town_id, smallint, 城镇ID
	 * 4 : quest_id, smallint, 任务 
	 */

	Id : 0,
	Enemy_id : 1,
	Content : 2,
	Town_id : 3,
	Quest_id : 4,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[3 /*[0]*/, 93 /*[1]*/, "MP=姑娘别闹了，你怎么了？\nMB=不开心，超生气的\nMP=冷静，你被阴影影响了\nMB=要你多管\n\nWP=姑娘别闹了，你怎么了？\nWB=我…烦死了！\nWP=你被阴影影响了！\nWB=要你多管！" /*[2]*/, 1 /*[3]*/, 10 /*[4]*/],
		[5 /*[0]*/, 27 /*[1]*/, "MP=媛媛，注意辅助我\nMZ=嗯\n\nWP=媛媛，注意辅助我\nWZ=嗯" /*[2]*/, 1 /*[3]*/, 16 /*[4]*/],
		[6 /*[0]*/, 45 /*[1]*/, "MB=让我生气后果很严重\nMB=小的们，给我上\nMP=小心，金蟾王已经被阴影控制了\n\nWB=让我生气后果很严重\nWB=小的们，给我上\nWP=小心，金蟾王已经被阴影控制了" /*[2]*/, 1 /*[3]*/, 26 /*[4]*/],
		[7 /*[0]*/, 54 /*[1]*/, "MZ=烂泥都能成精，这世界没道理了\nMB=你看起来最好吃\nMB=我一定留到最后再吃\nMZ=做梦\n\nWZ=烂泥都能成精，这世界没道理了\nWB=小姑娘，你看起来最好吃\nWB=我一定留到最后再吃\nWZ=做梦" /*[2]*/, 1 /*[3]*/, 30 /*[4]*/],
		[8 /*[0]*/, 63 /*[1]*/, "MB=小的们，把他们烤熟了带回去\nMY=大白天的打灯笼上厕所\nMB=什么意思？\nMY=找死啊\n\nWB=小的们，把他们烤熟了带回去\nWY=大白天的打灯笼上厕所\nWB=什么意思？\nWY=找死啊" /*[2]*/, 1 /*[3]*/, 61 /*[4]*/],
		[9 /*[0]*/, 72 /*[1]*/, "MB=我要把你们烧成灰烬\nMP=变成灰烬前能问个问题吗？\nMB=问吧，可怜虫\nMP=最近有人来过这里吗？\nMB=没有，你们是第一个\nMP=好吧，那我们可以走吗？\nMB=不可以，受死吧\n\nWB=我要把你们烧成灰烬\nWP=变成灰烬前能问个问题吗？\nWB=问吧，可怜虫\nWP=最近有人来过这里吗？\nWB=没有，你们是第一个\nWP=好吧，那我们可以走吗？\nWB=不可以，受死吧" /*[2]*/, 1 /*[3]*/, 39 /*[4]*/],
		[10 /*[0]*/, 87 /*[1]*/, "MB=想过留剑\nMP=没门\n\nWB=想过留剑\nWP=没门" /*[2]*/, 1 /*[3]*/, 63 /*[4]*/],
		[11 /*[0]*/, 90 /*[1]*/, "MB=年轻人，用你手中的剑\nMB=证明你的剑道吧\nMP=得罪了，前辈\n\nWB=年轻人，用你手中的剑\nWB=证明你的剑道吧\nWP=得罪了，前辈" /*[2]*/, 1 /*[3]*/, 46 /*[4]*/],
		[15 /*[0]*/, 315 /*[1]*/, "MP=啊，晓芸妹妹\nMP=大家小心别伤到晓芸妹妹\n\nWP=啊，晓芸妹妹\nWP=大家小心别伤到晓芸妹妹" /*[2]*/, 2 /*[3]*/, 93 /*[4]*/],
		[16 /*[0]*/, 318 /*[1]*/, "MP=仙子，得罪了\nMB=尽管来吧\n\nWP=仙子，得罪了\nWB=尽管来吧" /*[2]*/, 2 /*[3]*/, 95 /*[4]*/],
		[17 /*[0]*/, 319 /*[1]*/, "MC=不要生气，你听我说…\nMB=别念了…\n\nWC=不要生气，你听我说…\nWB=别念了…" /*[2]*/, 2 /*[3]*/, 96 /*[4]*/],
		[18 /*[0]*/, 301 /*[1]*/, "MB=小子，天堂有路你不走\nMB=地狱无门闯进来\nMP=废话少说，龙姬在哪？\nMB=想知道就打赢我\n\nWB=小丫头，天堂有路你不走\nWB=地狱无门闯进来\nWP=废话少说，龙姬在哪？\nWB=想知道就打赢我" /*[2]*/, 2 /*[3]*/, 90 /*[4]*/],
		[19 /*[0]*/, 311 /*[1]*/, "MB=你们怎么进来的？\nMB=来人啊！\nMP=叫破喉咙也没用！\nMP=受死吧\n\nWB=你们怎么进来的？\nWB=来人啊！\nWP=你猜我们怎么进来的～\nWP=受死吧" /*[2]*/, 2 /*[3]*/, 91 /*[4]*/],
		[20 /*[0]*/, 314 /*[1]*/, "MP=太好了，今天加菜\nMB=唬呲～\n\nWP=太好了，今天加菜\nWB=唬呲～" /*[2]*/, 2 /*[3]*/, 176 /*[4]*/],
		[21 /*[0]*/, 323 /*[1]*/, "MP=小心哦，大叔的墨画咒术很厉害的\n\nWP=小心哦，大叔的墨画咒术很厉害的" /*[2]*/, 2 /*[3]*/, 103 /*[4]*/],
		[22 /*[0]*/, 325 /*[1]*/, "MP=我们还不需要超渡\nMB=下地狱的人都有罪\n\nWP=我们还不需要超渡\nWB=下地狱的人都有罪" /*[2]*/, 2 /*[3]*/, 104 /*[4]*/],
		[23 /*[0]*/, 327 /*[1]*/, "MB=哼，就凭你们也想赢我\nMP=不试试怎么知道行不行\nMB=好，那就先干掉你们\nMB=再找奸奇算账\n\nWB=哼，就凭你们也想赢我\nWP=不试试怎么知道行不行\nWB=好，那就先干掉你们\nWB=再找奸奇算账" /*[2]*/, 2 /*[3]*/, 106 /*[4]*/],
		[24 /*[0]*/, 330 /*[1]*/, "MB=大侠，请手下留情哈\nMB=小的弱不经风的\nMP=哼，胡言乱语\nMB=哈哈\n\nWB=大侠，请手下留情哈\nWB=小的弱不经风的\nWP=哼，胡言乱语\nWB=哈哈" /*[2]*/, 2 /*[3]*/, 107 /*[4]*/],
		[25 /*[0]*/, 406 /*[1]*/, "MP=吃饭睡觉打豆豆～\nMB=气死本帅也～看招！\n\nWP=吃饭睡觉打豆豆～\nWB=气死本帅也～看招！" /*[2]*/, 4 /*[3]*/, 177 /*[4]*/],
		[26 /*[0]*/, 407 /*[1]*/, "MB=武道之途殊途同归，来吧\nMP=前辈！得罪了\n\nWB=武道之途殊途同归，来吧\nWP=前辈！得罪了" /*[2]*/, 4 /*[3]*/, 190 /*[4]*/],
		[27 /*[0]*/, 408 /*[1]*/, "MP=桃花源的树成精还好看些\nMP=这只太丑了\n\nWP=桃花源的树成精还好看些\nWP=这只太丑了" /*[2]*/, 4 /*[3]*/, 198 /*[4]*/],
		[28 /*[0]*/, 409 /*[1]*/, "MB=你们休想夺走我的剑！\n\nWB=你们休想夺走我的剑！" /*[2]*/, 4 /*[3]*/, 205 /*[4]*/],
		[29 /*[0]*/, 410 /*[1]*/, "ZYY=打完树妖打石头灵气太重也不是好事啊" /*[2]*/, 4 /*[3]*/, 213 /*[4]*/],
		[30 /*[0]*/, 413 /*[1]*/, "MB=我要变得更强！变得更强\nMB=我来帮你实现你的大侠梦吧！哈哈哈\nMP=我更拥有战胜自己的力量！\n\nWB=我要变得更强！变得更强\nWB=我来帮你实现你的大侠梦吧！哈哈哈\nWP=我更拥有战胜自己的力量！" /*[2]*/, 4 /*[3]*/, 235 /*[4]*/],
		[31 /*[0]*/, 414 /*[1]*/, "MP=徐福在哪？\nMB=竟敢以下犯上，死吧！\n\nWP=徐福在哪？\nWB=竟敢以下犯上，死吧！" /*[2]*/, 4 /*[3]*/, 243 /*[4]*/],
		[32 /*[0]*/, 417 /*[1]*/, "MB=几天不见倒是变强不少\nMB=可惜蝼蚁始终难逃被踩死的命运\n\nWB=几天不见倒是变强不少\nWB=可惜蝼蚁始终难逃被踩死的命运" /*[2]*/, 4 /*[3]*/, 249 /*[4]*/],
		[33 /*[0]*/, 501 /*[1]*/, "MP=他被阴影附身了！\nMP=大家小心\nMB=我的美人在哪里\n\nWP=他被阴影附身了！\nWP=大家小心\nWB=我的美人在哪里" /*[2]*/, 5 /*[3]*/, 586 /*[4]*/],
		[42 /*[0]*/, 502 /*[1]*/, "MB=小哥你一点都不懂得怜香惜玉\nMP=少废话！\n\nWB=一点都不懂得怜香惜玉\nWP=少废话！" /*[2]*/, 5 /*[3]*/, 593 /*[4]*/],
		[43 /*[0]*/, 503 /*[1]*/, "MB=吹飞你们！\nWB=吹飞你们！" /*[2]*/, 5 /*[3]*/, 602 /*[4]*/],
		[44 /*[0]*/, 504 /*[1]*/, "MB=你们还真是阴魂不散\nMB=这次算你们厉害\nMP=不会让你们得逞的！\n\nWB=你们还真是阴魂不散\nWB=这次算你们厉害\nWP=不会让你们得逞的！" /*[2]*/, 5 /*[3]*/, 609 /*[4]*/],
		[45 /*[0]*/, 505 /*[1]*/, "MB=小看我的毒！\nMB=你们会后悔的！\n\nWB=小看我的毒！\nWB=你们会后悔的！" /*[2]*/, 5 /*[3]*/, 617 /*[4]*/],
		[47 /*[0]*/, 506 /*[1]*/, "MB=与我为敌\nMB=掂量过自己的实力吗？\n\nWB=与我为敌\nWB=掂量过自己的实力吗？" /*[2]*/, 5 /*[3]*/, 622 /*[4]*/],
		[48 /*[0]*/, 507 /*[1]*/, "MB=其实我不想为难你们\nMP=不会再听你胡言乱语！\n\nWB=其实我不想为难你们\nWP=不会再听你胡言乱语！" /*[2]*/, 5 /*[3]*/, 630 /*[4]*/],
		[49 /*[0]*/, 508 /*[1]*/, "" /*[2]*/, 5 /*[3]*/, 636 /*[4]*/],
		[50 /*[0]*/, 849 /*[1]*/, "MP=小心别伤到唐卿\n\nWP=小心别伤到唐卿" /*[2]*/, 7 /*[3]*/, 1100 /*[4]*/],
		[51 /*[0]*/, 842 /*[1]*/, "MB=唐卿…唐家堡弟子…都要跟我走…\n\nWB=唐卿…唐家堡弟子…都要跟我走…" /*[2]*/, 7 /*[3]*/, 1030 /*[4]*/],
		[52 /*[0]*/, 878 /*[1]*/, "MP=住手！\nMB=又是你们！\n\nWP=住手！\nWB=又是你们！" /*[2]*/, 7 /*[3]*/, 1047 /*[4]*/],
		[53 /*[0]*/, 904 /*[1]*/, "MB=贼人！看剑！\nYMZ=哇哇！这什么情况！\n\nWB=贼人！看剑！\nYMZ=哇哇！这什么情况！" /*[2]*/, 7 /*[3]*/, 1056 /*[4]*/],
		[54 /*[0]*/, 924 /*[1]*/, "MB=我不入地狱，谁入地狱！\n\nWB=我不入地狱，谁入地狱！" /*[2]*/, 7 /*[3]*/, 1076 /*[4]*/],
		[55 /*[0]*/, 947 /*[1]*/, "MP=为什么要帮助魔头\nMB=我想干什么就干什么\nMB=你管我？\n\nWP=为什么要帮助魔头\nWB=我想干什么就干什么\nWB=你管我？" /*[2]*/, 7 /*[3]*/, 1092 /*[4]*/],
		[56 /*[0]*/, 974 /*[1]*/, "MZ=怎么回事！\nMY=小心！\nMP=那是我们的心魔\n\nWZ=怎么回事！\nWY=小心！\nWP=那是我们的心魔" /*[2]*/, 0 /*[3]*/, 0 /*[4]*/],
		[58 /*[0]*/, 975 /*[1]*/, "" /*[2]*/, 0 /*[3]*/, 0 /*[4]*/],
		[62 /*[0]*/, 430 /*[1]*/, "MP=昨天梦妖阿樂告诉我\nMP=这根竹子里藏了把很厉害的武器\nMB=你胡说八道什么，拿命来\nMP=小心，这只竹筒精看起来很强\n\nWP=昨天梦妖阿樂告诉我\nWP=这根竹子里藏了把很厉害的武器\nWB=你胡说八道什么，拿命来\nWP=小心，这只竹筒精看起来很强" /*[2]*/, 0 /*[3]*/, 0 /*[4]*/]
	],
};
