var opera_announcement_data = {
		/**
	 * 0 : id, int, 公告模版ID
	 * 1 : title, varchar, 公告名
	 * 2 : content, varchar, 内容
	 * 3 : effect_time, bigint, 生效时间
	 * 4 : expire_time, bigint, 结束时间 0 永远有效 
	 */

	Id : 0,
	Title : 1,
	Content : 2,
	Effect_time : 3,
	Expire_time : 4,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[2 /*[0]*/, "五日累积登入！送极品！" /*[1]*/, "活动时间：删档测试期间\n活动内容：玩家累积登入5天，每日可领取各种极品奖励\n活动奖励：\n天数           奖励内容\n第一天       200元宝\n第二天       专属魂侍“将臣”\n第三天       珠宝盒（约50W铜钱）\n第四天       金色剑心“赤霄”\n第五天       588元宝" /*[2]*/, 1411962120 /*[3]*/, 0 /*[4]*/],
		[3 /*[0]*/, "升等级，送福利！" /*[1]*/, "活动时间：删档测试期间\n活动内容：玩家等级达到相应条件，就可领取对应奖励\n活动奖励：\n5级—30级     每提升5级即可获得“5个铜钱袋”\n35级—60级   每提升5级即可获得“10个铜钱袋”\n（奖励将通过邮件形式发放，请注意查收）" /*[2]*/, 1411962660 /*[3]*/, 0 /*[4]*/],
		[4 /*[0]*/, "升战力，送元宝！" /*[1]*/, "活动时间：删档测试期间\n活动内容：玩家战力达到相应条件，就可领取对应元宝\n活动奖励：\n战力        奖励元宝\n5000\t       58元宝\n10000      68元宝\n20000      88元宝\n30000      128元宝\n40000      188元宝\n50000      248元宝\n60000      388元宝" /*[2]*/, 1411962660 /*[3]*/, 0 /*[4]*/],
		[5 /*[0]*/, "冲级公测返奖励" /*[1]*/, "活动时间：删档测试期间\n活动描述：玩家在内测达到一定等级级别，公测返礼包奖励\n活动奖励：\n25级     返还200元宝\n35级     返还250元宝\n40级     返还300元宝" /*[2]*/, 1411962660 /*[3]*/, 0 /*[4]*/],
		[6 /*[0]*/, "充值元宝双倍返利！" /*[1]*/, "活动时间：删档测试期间\n活动描述：在删档测试期间，单笔充值金额满足每个档位的对应的金额，即赠送等额元宝，并在公测期间返还全部元宝，但不返还VIP等级" /*[2]*/, 1412758800 /*[3]*/, 0 /*[4]*/]
	],
};
