var quest_activity_center_data = {
		/**
	 * 0 : id, smallint, 
	 * 1 : relative, smallint, 关联的活动
	 * 2 : weight, int, 活动权值
	 * 3 : name, varchar, 活动名称(列表左侧)
	 * 4 : title, varchar, 活动标题(列表右侧)
	 * 5 : content, text, 活动描述
	 * 6 : start, bigint, 活动开始时间戳
	 * 7 : end, bigint, 活动结束时间戳
	 * 8 : is_go, tinyint, 是否前往
	 * 9 : tag, tinyint, 活动标签(1:最新,2:限时,3:推荐)
	 * 10 : condition_template, varchar, 领奖条件模版,{val}代表临界值
	 * 11 : dispose, bigint, 活动过期时间戳
	 * 12 : sign, varchar, 活动标识
	 * 13 : is_relative, tinyint, 是否为相对时间 
	 */

	Id : 0,
	Relative : 1,
	Weight : 2,
	Name : 3,
	Title : 4,
	Content : 5,
	Start : 6,
	End : 7,
	Is_go : 8,
	Tag : 9,
	Condition_template : 10,
	Dispose : 11,
	Sign : 12,
	Is_relative : 13,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[1 /*[0]*/, 3 /*[1]*/, 20 /*[2]*/, "累计登入" /*[3]*/, "累计登入" /*[4]*/, "活动期间，玩家累积登入7天，每日可领取各种极品奖励 \n活动奖励：\n天数           奖励内容\n第一天       200元宝\n第二天       珠宝盒（约50W铜钱）\n第三天       时装及紫色结晶（50个）\n第四天       金色魂侍“洛神”\n第五天       极品灵宠“雷兽”\n第六天       金色剑心“赤霄”（邮件发放）\n第七天       潜龙剑心10个（邮件发放）" /*[5]*/, 1414512000 /*[6]*/, 1414598400 /*[7]*/, 1 /*[8]*/, 1 /*[9]*/, "" /*[10]*/, 1414598400 /*[11]*/, "EVENT_LOGIN_AWARD" /*[12]*/, 0 /*[13]*/],
		[2 /*[0]*/, 1 /*[1]*/, 4 /*[2]*/, "神龙陪同" /*[3]*/, "神龙陪同" /*[4]*/, "活动期间，玩家每提升5级即可领取对应等级奖励 。\n活动奖励：\n5级         5000铜钱，鸡腿X5\n10级       10000铜币，鸡腿X10\n15级       15000铜钱\n20级       20000铜钱\n25级       25000铜钱，魂侍果实X10\n30级       30000铜钱，鸡腿X5\n35级       朱雀剑X1\n40级       40000铜钱，圣器X1\n45级       45000铜钱，珠宝盒X1\n50级       50000铜钱，武功心得X10\n55级       55000铜钱，东瀛武士碎片X5\n60级       60000铜钱，朱雀刀X1\n70级       魂侍果实X100，剑灵魂侍碎片X3\n80级       月影龙珠X2\n90级       月影龙珠X3\n100级     10万铜钱，剑灵魂侍碎片X5\n110级     日曜龙珠X2\n120级     日曜龙珠X3\n130级     13万铜钱，苏摩力士魂侍碎片X3\n140级     14万铜钱，洛神魂侍碎片X3\n150级     混元戒，10个铜钱袋" /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 0 /*[8]*/, 3 /*[9]*/, "等级{val}" /*[10]*/, 0 /*[11]*/, "EVENT_LEVEL_AWARD" /*[12]*/, 0 /*[13]*/],
		[3 /*[0]*/, 2 /*[1]*/, 5 /*[2]*/, "战力活动" /*[3]*/, "战力活动" /*[4]*/, "活动期间，玩家达到指定战力可领取对应战力奖励 。\n活动奖励：\n战力20000       128元宝\n战力30000       188元宝\n战力40000       268元宝\n战力50000       388元宝\n战力60000       588元宝" /*[5]*/, 0 /*[6]*/, 2591999 /*[7]*/, 0 /*[8]*/, 2 /*[9]*/, "战力{val}" /*[10]*/, 2591999 /*[11]*/, "EVENT_STRONG_AWARD" /*[12]*/, 1 /*[13]*/],
		[5 /*[0]*/, 4 /*[1]*/, 11 /*[2]*/, "首次充值翻倍" /*[3]*/, "首次充值翻倍" /*[4]*/, "活动期间，首次充值任意金额，即可获得翻倍的元宝，每个金额机会只有一次，充的越多优惠越多。（赠送元宝不算到VIP）" /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 1 /*[8]*/, 3 /*[9]*/, "" /*[10]*/, 0 /*[11]*/, "EVENT_RECHARGE_AWARD" /*[12]*/, 0 /*[13]*/],
		[6 /*[0]*/, 5 /*[1]*/, 9 /*[2]*/, "江湖争霸" /*[3]*/, "江湖争霸" /*[4]*/, "活动期间，比武场排行榜前10名玩家获得相应奖励。\nTop 1: 月影戒，铜袋X30\nTop 2: 月影袍，铜袋X20\nTop 3: 月影靴，铜袋X10\nTop 4: 星辉戒，魂侍果实X200\nTop 5-10 : 星辉靴，魂侍果实X100" /*[5]*/, 0 /*[6]*/, 604800 /*[7]*/, 1 /*[8]*/, 2 /*[9]*/, "第{val}名" /*[10]*/, 863999 /*[11]*/, "EVENT_ARENA_RANK_AWARDS" /*[12]*/, 1 /*[13]*/],
		[7 /*[0]*/, 6 /*[1]*/, 100 /*[2]*/, "通关奖励翻倍" /*[3]*/, "通关奖励翻倍！" /*[4]*/, "玩家通过（普通关卡、精英关卡、BOSS关卡）中所获铜钱&经验奖励翻倍 \n活动时间：2014年11月10日-2014年11月23日" /*[5]*/, 1414512000 /*[6]*/, 1414598400 /*[7]*/, 2 /*[8]*/, 0 /*[9]*/, "" /*[10]*/, 1414598400 /*[11]*/, "EVENT_MULTIPY_CONFIG" /*[12]*/, 0 /*[13]*/],
		[8 /*[0]*/, 7 /*[1]*/, 1 /*[2]*/, "累计消耗体力" /*[3]*/, "累计消耗体力" /*[4]*/, "玩家每日消耗体力数累计达到活动奖励条件时，即可领取丰厚奖励！" /*[5]*/, 0 /*[6]*/, 431999 /*[7]*/, 0 /*[8]*/, 4 /*[9]*/, "消耗体力{val}" /*[10]*/, 431999 /*[11]*/, "EVENT_PHYSICAL_AWARDS" /*[12]*/, 1 /*[13]*/],
		[9 /*[0]*/, 8 /*[1]*/, 2 /*[2]*/, "月卡返利" /*[3]*/, "月卡返利" /*[4]*/, "单笔充值购买300元宝及以上，可自动激活月卡返利活动。\n激活后30天内，每天可领取100元宝奖励。" /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 0 /*[8]*/, 3 /*[9]*/, "" /*[10]*/, 0 /*[11]*/, "EVENT_MONTH_CARD_AWARDS" /*[12]*/, 0 /*[13]*/],
		[10 /*[0]*/, 9 /*[1]*/, 0 /*[2]*/, "豪华午餐" /*[3]*/, "豪华午餐" /*[4]*/, "每日 12：00 到 14：00 领取豪华午餐！吃饱喝足才有力气打怪哦！" /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 0 /*[8]*/, 4 /*[9]*/, "" /*[10]*/, 0 /*[11]*/, "EVENT_DINNER_AWARDS" /*[12]*/, 0 /*[13]*/],
		[11 /*[0]*/, 10 /*[1]*/, 0 /*[2]*/, "豪华晚餐" /*[3]*/, "豪华晚餐" /*[4]*/, "每日 18：00 到 20：00可领取豪华晚餐！为大侠补充体力～继续闯荡您的仙侠世界！" /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 0 /*[8]*/, 4 /*[9]*/, "" /*[10]*/, 0 /*[11]*/, "EVENT_SUPPER_AWARDS" /*[12]*/, 0 /*[13]*/],
		[12 /*[0]*/, 11 /*[1]*/, 30 /*[2]*/, "QQ特权奖励" /*[3]*/, "QQ特权奖励" /*[4]*/, "<font color=#FFD167 >特权一、通关奖励加成！</font>\nQQ会员玩家通过普通、精英及BOSS关卡时所获得经验和铜钱额外加成10%\n<font color=#FFD167 >特权二、每日登录奖励！</font>\nQQ会员玩家每日登录游戏，即可在该活动界面中领取当日福利奖励！连续登录更有额外奖励领取" /*[5]*/, 1415548800 /*[6]*/, 1415548800 /*[7]*/, 0 /*[8]*/, 0 /*[9]*/, "" /*[10]*/, 1415548800 /*[11]*/, "EVENT_QQVIP_GIFT_AWARDS" /*[12]*/, 0 /*[13]*/],
		[13 /*[0]*/, 12 /*[1]*/, 33 /*[2]*/, "QQ特权奖励加成" /*[3]*/, "QQ特权奖励加成" /*[4]*/, "" /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 0 /*[8]*/, 0 /*[9]*/, "" /*[10]*/, 0 /*[11]*/, "EVENT_QQVIP_ADDITION" /*[12]*/, 0 /*[13]*/],
		[14 /*[0]*/, 13 /*[1]*/, 7 /*[2]*/, "仙尊俱乐部" /*[3]*/, "仙尊俱乐部" /*[4]*/, "当本服仙尊人数满足条件时，全体仙尊玩家均能享丰厚奖励！\n充值任意金额即能成为仙尊。" /*[5]*/, 0 /*[6]*/, 604799 /*[7]*/, 0 /*[8]*/, 3 /*[9]*/, "" /*[10]*/, 604799 /*[11]*/, "EVENT_VIP_CLUB" /*[12]*/, 1 /*[13]*/],
		[15 /*[0]*/, 14 /*[1]*/, 20 /*[2]*/, "土豪俱乐部" /*[3]*/, "土豪俱乐部" /*[4]*/, "当本服特定仙尊人数达标时，满足条件的仙尊玩家均能享受丰厚奖励！" /*[5]*/, 1414512000 /*[6]*/, 1414512000 /*[7]*/, 0 /*[8]*/, 3 /*[9]*/, "" /*[10]*/, 1414512000 /*[11]*/, "EVENT_RICHMAN_CLUB" /*[12]*/, 0 /*[13]*/],
		[16 /*[0]*/, 15 /*[1]*/, 20 /*[2]*/, "天下第一" /*[3]*/, "天下第一" /*[4]*/, "活动期间，等级排行榜前5名玩家获得相应奖励。\nTop 1: 5000元宝，天书残页X50\nTop 2: 3000元宝, 幻光贝壳X30\nTop 3: 2000元宝, 醉生梦死X20\nTop 4: 1000元宝, 七心海棠X10\nTop 5: 500元宝, 甲贺苦无X10" /*[5]*/, 1415548800 /*[6]*/, 1415548800 /*[7]*/, 2 /*[8]*/, 3 /*[9]*/, "" /*[10]*/, 1415548800 /*[11]*/, "EVENT_LEVEL_RECHARGE" /*[12]*/, 0 /*[13]*/],
		[17 /*[0]*/, 16 /*[1]*/, 6 /*[2]*/, "首充礼包" /*[3]*/, "首充礼包" /*[4]*/, "玩家首次完成任意金额充值即可获得豪华首充奖励！\n活动奖励：\n星辉天诛戒x1\n喜好品（秘籍残页）X10\n爱心X10\n\n（奖励将以邮件发放，请注意查收）" /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 1 /*[8]*/, 3 /*[9]*/, "" /*[10]*/, 0 /*[11]*/, "EVENT_FIRST_RECHARGE" /*[12]*/, 0 /*[13]*/],
		[19 /*[0]*/, 17 /*[1]*/, 3 /*[2]*/, "七日新手礼" /*[3]*/, "七日新手礼" /*[4]*/, "活动期间，玩家每日登录可领取当日对应的极品奖励。\n 活动奖励：\n第一天       100元宝\n第二天       珠宝盒（约20W铜钱）\n第三天       限时时装\n第四天       128元宝及影界果实（50个）\n第五天       灵宠魔笔\n第六天       168元宝及灵魄（20个）\n第七天       喜好品（秘籍残页）x20\n（如当日未登录游戏即无法领取本日所对应的奖励）" /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 1 /*[8]*/, 4 /*[9]*/, "" /*[10]*/, 0 /*[11]*/, "EVENT_SEVEN_DAY_AWARDS" /*[12]*/, 0 /*[13]*/],
		[20 /*[0]*/, 18 /*[1]*/, 31 /*[2]*/, "江湖侠客乐分享" /*[3]*/, "江湖侠客乐分享" /*[4]*/, "大侠在仙侠道世界中成功分享的次数累计达到指定次数，可获得相应的奖励。" /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 0 /*[8]*/, 3 /*[9]*/, "" /*[10]*/, 0 /*[11]*/, "EVENT_SHARE_AWARDS" /*[12]*/, 0 /*[13]*/],
		[21 /*[0]*/, 19 /*[1]*/, 29 /*[2]*/, "团购活动" /*[3]*/, "时装" /*[4]*/, "活动期间，认购数量越多价格越优惠！若物品最终价格低于您认购时的花费，将退还差价。" /*[5]*/, 1415548800 /*[6]*/, 1415548801 /*[7]*/, 0 /*[8]*/, 2 /*[9]*/, "" /*[10]*/, 1415548801 /*[11]*/, "EVENT_GROUP_BUY" /*[12]*/, 0 /*[13]*/],
		[23 /*[0]*/, 20 /*[1]*/, 18 /*[2]*/, "神龙大幅" /*[3]*/, "神龙大幅" /*[4]*/, "活动期间，玩家累计充值元宝（不计算赠送元宝）达到对应要求，可领取对应物品奖励" /*[5]*/, 1415548800 /*[6]*/, 1415548800 /*[7]*/, 0 /*[8]*/, 2 /*[9]*/, "" /*[10]*/, 1415548800 /*[11]*/, "EVENT_TOTAL_RECHARGE" /*[12]*/, 0 /*[13]*/],
		[24 /*[0]*/, 22 /*[1]*/, 22 /*[2]*/, "邀请胧月" /*[3]*/, "邀请胧月" /*[4]*/, "初始等级[level]级，东瀛女忍者，性情阴晴不定，花费[ingot]即可邀请胧月加入队伍(赠送专属紫色武器及魂侍将通过邮件发放）" /*[5]*/, 1414512000 /*[6]*/, 1414512000 /*[7]*/, 0 /*[8]*/, 3 /*[9]*/, "" /*[10]*/, 1414512000 /*[11]*/, "EVENT_BUY_PARTNER" /*[12]*/, 0 /*[13]*/],
		[25 /*[0]*/, 23 /*[1]*/, 18 /*[2]*/, "十连抽大返利" /*[3]*/, "十连抽大返利" /*[4]*/, "活动期间，玩家累计十连抽宝箱（神魂宝箱及神兽宝箱）达到对应次数，即可领取即可领取胧月专属金色魂侍！" /*[5]*/, 1415548800 /*[6]*/, 1415548800 /*[7]*/, 0 /*[8]*/, 2 /*[9]*/, "" /*[10]*/, 1415548800 /*[11]*/, "EVENT_TEN_DRAW" /*[12]*/, 0 /*[13]*/],
		[26 /*[0]*/, 21 /*[1]*/, 18 /*[2]*/, "消费大返利" /*[3]*/, "消费大返利" /*[4]*/, "活动期间，玩家通过任意方式每消耗200元宝即可领取一个随机百宝箱，开启宝箱有几率获得极品魂侍武灵。" /*[5]*/, 1415548800 /*[6]*/, 1415548800 /*[7]*/, 0 /*[8]*/, 2 /*[9]*/, "" /*[10]*/, 1415548800 /*[11]*/, "EVENT_TOTAL_CONSUME" /*[12]*/, 0 /*[13]*/],
		[28 /*[0]*/, 24 /*[1]*/, 18 /*[2]*/, "每日充值礼" /*[3]*/, "每日充值礼" /*[4]*/, "活动期间，玩家每日首次完成任意金额充值，即可领取对“限定魂侍碎片”奖励。\n（若充值完成但当日未领取奖励，之后无法领取该日奖励）" /*[5]*/, 1415548800 /*[6]*/, 1415548800 /*[7]*/, 0 /*[8]*/, 2 /*[9]*/, "" /*[10]*/, 1415548800 /*[11]*/, "EVENT_FIRST_RECHARGE_DAILY" /*[12]*/, 0 /*[13]*/],
		[29 /*[0]*/, 25 /*[1]*/, 18 /*[2]*/, "连续登录奖励" /*[3]*/, "连续登录奖励" /*[4]*/, "圣诞期间，根据玩家连续登录天数，每日可领取对应不同连续登录天数的连续登录奖励。\n连续登录4天及以上为中级登录奖励\n连续登录7天及以上为高级登录奖励\n（若玩家一日未登录游戏，连续登录天数将会重置）" /*[5]*/, 1415548800 /*[6]*/, 1415548800 /*[7]*/, 0 /*[8]*/, 2 /*[9]*/, "" /*[10]*/, 1415548800 /*[11]*/, "EVENT_TOTAL_LOGIN" /*[12]*/, 0 /*[13]*/]
	],
};
