var trader_data = {
		/**
	 * 0 : id, smallint, ID
	 * 1 : name, varchar, NPC名称
	 * 2 : sign, varchar, 资源标识
	 * 3 : talk, varchar, 对话
	 * 4 : sold_out_talk, varchar, 售罄对话
	 * 5 : deal_talk, varchar, 成交对话 
	 */

	Id : 0,
	Name : 1,
	Sign : 2,
	Talk : 3,
	Sold_out_talk : 4,
	Deal_talk : 5,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[1 /*[0]*/, "瀛海集市" /*[1]*/, "YingHaiJiShi" /*[2]*/, "我是荧惑，请多关照！||你是来看货还是来看我的，我要保持神秘。||我会在每天的12点，18点和21点换上新的货物。||你在点哪里？" /*[3]*/, "货物已经售空了。大侠...你还要吗？||看来这些商品很受欢迎。" /*[4]*/, "谢谢惠顾，大侠很有眼光。||成交||我就知道你喜欢" /*[5]*/],
		[2 /*[0]*/, "巡游商人" /*[1]*/, "XunYouShangRen" /*[2]*/, "我带来了一点新东西，希望你喜欢。||我是真真，我喜欢探索世界。||小天是我的好伙伴哦～我要永远和小天在一起。||我走过了世界各地，我知道什么是好东西～" /*[3]*/, "我很高兴你喜欢我的东西。||我下次再来的时候不要错过哦。" /*[4]*/, "成交！||你的选择非常正确！" /*[5]*/],
		[3 /*[0]*/, "黑市老大" /*[1]*/, "HeiShiLaoDa" /*[2]*/, "一手交钱，一手交货。||我叫挺爷，我可以给你你想要的东西。||晚上21点再来看看新东西，不要向任何人提起我。||我的宠物经记住你的气味。||时间就是金钱。" /*[3]*/, "只要价钱合适，我可以马上给你搞来一批新货。||这个宝贝炙手可热。" /*[4]*/, "你很有眼光。||一手交钱，一手交货。" /*[5]*/]
	],
};
