<?php
$this->AddSQL("

DROP TABLE IF EXISTS `daily_sign_in_award`;
CREATE TABLE `daily_sign_in_award` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `type` tinyint(4) NOT NULL COMMENT '签到类型 0--首次登录奖励 1--全局循环奖励',
  `award_type` tinyint(4) NOT NULL COMMENT '奖励类型',
  `award_id` smallint(6) NOT NULL COMMENT '奖励物品ID',
  `num` int(11) NOT NULL COMMENT '奖励数量',
  `vip_double` tinyint(4) NOT NULL DEFAULT '0' COMMENT 'vip用户获得双倍奖励',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=71 DEFAULT CHARSET=utf8mb4 COMMENT='每日签到奖励配置';


INSERT INTO `daily_sign_in_award` VALUES (1,0,4,0,50,0),(2,0,1,263,10,0),(3,0,4,0,50,0),(4,0,1,263,10,0),(5,0,4,0,50,0),(6,0,1,432,10,0),(7,0,4,0,50,0),(8,0,1,263,10,0),(9,0,4,0,50,0),(10,0,1,263,10,0),(11,0,4,0,50,0),(12,0,1,432,10,0),(13,0,4,0,50,0),(14,0,1,263,10,0),(43,1,1,302,5,0),(44,1,1,263,5,1),(45,1,4,0,50,0),(46,1,1,432,5,1),(47,1,3,0,10000,0),(48,1,1,355,5,1),(49,1,4,0,50,0),(50,1,1,302,5,0),(51,1,1,263,5,1),(52,1,4,0,50,0),(53,1,1,432,5,1),(54,1,3,0,10000,0),(55,1,1,355,5,1),(56,1,4,0,50,0),(57,1,1,302,5,0),(58,1,1,263,5,1),(59,1,4,0,50,0),(60,1,1,432,5,1),(61,1,3,0,10000,0),(62,1,1,355,5,1),(63,1,4,0,50,0),(64,1,1,302,5,0),(65,1,1,263,5,1),(66,1,4,0,50,0),(67,1,1,432,5,1),(68,1,3,0,10000,0),(69,1,1,355,5,1),(70,1,4,0,50,0);
");

?>
