var aura_data = {
		/**
	 * 0 : id, smallint, 
	 * 1 : name, varchar, 绝招名称
	 * 2 : sign, varchar, 资源标识
	 * 3 : target, tinyint, 1--全体 2--己方全体 3--敌方全体
	 * 4 : mode, tinyint, buff类型
	 * 5 : description, varchar, 描述
	 * 6 : is_buff, tinyint, 是增益buff 
	 */

	Id : 0,
	Name : 1,
	Sign : 2,
	Target : 3,
	Mode : 4,
	Description : 5,
	Is_buff : 6,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[2 /*[0]*/, "强击光环" /*[1]*/, "光环红" /*[2]*/, 2 /*[3]*/, 2 /*[4]*/, "光环：己方攻击增加$a" /*[5]*/, 1 /*[6]*/],
		[3 /*[0]*/, "壁垒光环" /*[1]*/, "光环黄" /*[2]*/, 2 /*[3]*/, 3 /*[4]*/, "光环：己方防御增加$a" /*[5]*/, 1 /*[6]*/],
		[4 /*[0]*/, "迅捷光环" /*[1]*/, "光环绿" /*[2]*/, 2 /*[3]*/, 38 /*[4]*/, "光环：己方闪避增加$a%" /*[5]*/, 1 /*[6]*/],
		[5 /*[0]*/, "精准光环" /*[1]*/, "光环蓝" /*[2]*/, 2 /*[3]*/, 39 /*[4]*/, "光环：己方命中增加$a%" /*[5]*/, 1 /*[6]*/],
		[6 /*[0]*/, "杀意光环" /*[1]*/, "光环红" /*[2]*/, 2 /*[3]*/, 40 /*[4]*/, "光环：己方暴击增加$a%" /*[5]*/, 1 /*[6]*/],
		[7 /*[0]*/, "坚韧光环" /*[1]*/, "光环黄" /*[2]*/, 2 /*[3]*/, 41 /*[4]*/, "光环：己方韧性增加$a" /*[5]*/, 1 /*[6]*/],
		[8 /*[0]*/, "衰弱光环" /*[1]*/, "光环红" /*[2]*/, 3 /*[3]*/, 2 /*[4]*/, "光环：敌方攻击降低$a" /*[5]*/, 0 /*[6]*/],
		[9 /*[0]*/, "腐化光环" /*[1]*/, "光环蓝" /*[2]*/, 3 /*[3]*/, 3 /*[4]*/, "光环：敌方防御降低$a" /*[5]*/, 0 /*[6]*/],
		[10 /*[0]*/, "洞察光环" /*[1]*/, "光环绿" /*[2]*/, 3 /*[3]*/, 38 /*[4]*/, "光环：敌方闪避降低$a%" /*[5]*/, 0 /*[6]*/],
		[11 /*[0]*/, "迷惑光环" /*[1]*/, "光环黄" /*[2]*/, 3 /*[3]*/, 39 /*[4]*/, "光环：敌方命中降低$a%" /*[5]*/, 0 /*[6]*/],
		[12 /*[0]*/, "魔王光环" /*[1]*/, "光环红" /*[2]*/, 2 /*[3]*/, 9 /*[4]*/, "拥有非常强大的力量" /*[5]*/, 0 /*[6]*/]
	],
};
