var clique_building_bank_data = {
		/**
	 * 0 : id, int, 标识ID
	 * 1 : level, smallint, 钱庄等级
	 * 2 : silver_coupon_coins, int, 银劵底价
	 * 3 : silver_coupon_num, smallint, 银劵限购
	 * 4 : silver_coupon_sold, int, 银劵售价
	 * 5 : gold_coupon_coins, int, 金劵底价
	 * 6 : gold_coupon_num, smallint, 金劵限购
	 * 7 : gold_coupon_sold, int, 金劵售价
	 * 8 : upgrade, bigint, 钱庄升级所需铜钱
	 * 9 : desc, text, 对应等级描述
	 * 10 : cur_level_desc, text, 当前钱庄描述
	 * 11 : next_level_desc, text, 下一等级钱庄描述 
	 */

	Id : 0,
	Level : 1,
	Silver_coupon_coins : 2,
	Silver_coupon_num : 3,
	Silver_coupon_sold : 4,
	Gold_coupon_coins : 5,
	Gold_coupon_num : 6,
	Gold_coupon_sold : 7,
	Upgrade : 8,
	Desc : 9,
	Cur_level_desc : 10,
	Next_level_desc : 11,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[1 /*[0]*/, 0 /*[1]*/, 10000 /*[2]*/, 20 /*[3]*/, 10000 /*[4]*/, 0 /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 500000 /*[8]*/, "建设后开启帮派银券、金券投资\n升级建筑可以提升投资收益" /*[9]*/, "无" /*[10]*/, "银券利率2%" /*[11]*/],
		[2 /*[0]*/, 1 /*[1]*/, 10000 /*[2]*/, 20 /*[3]*/, 10200 /*[4]*/, 0 /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 800000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率2%" /*[9]*/, "银券利率2%" /*[10]*/, "银券利率3%" /*[11]*/],
		[3 /*[0]*/, 2 /*[1]*/, 10000 /*[2]*/, 20 /*[3]*/, 10300 /*[4]*/, 0 /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 1000000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率3%" /*[9]*/, "银券利率3%" /*[10]*/, "银券利率4%" /*[11]*/],
		[4 /*[0]*/, 3 /*[1]*/, 10000 /*[2]*/, 20 /*[3]*/, 10400 /*[4]*/, 0 /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 1200000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率4%" /*[9]*/, "银券利率4%" /*[10]*/, "银券利率5%" /*[11]*/],
		[5 /*[0]*/, 4 /*[1]*/, 10000 /*[2]*/, 21 /*[3]*/, 10500 /*[4]*/, 0 /*[5]*/, 0 /*[6]*/, 0 /*[7]*/, 1600000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率5%" /*[9]*/, "银券利率5%" /*[10]*/, "银券利率5%，开启金券兑换" /*[11]*/],
		[6 /*[0]*/, 5 /*[1]*/, 10000 /*[2]*/, 22 /*[3]*/, 10500 /*[4]*/, 100 /*[5]*/, 3 /*[6]*/, 102 /*[7]*/, 2000000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率5%，金券利率2%" /*[9]*/, "银券利率5%，金券利率2%" /*[10]*/, "银券利率6%，金券利率2%" /*[11]*/],
		[7 /*[0]*/, 6 /*[1]*/, 10000 /*[2]*/, 23 /*[3]*/, 10600 /*[4]*/, 100 /*[5]*/, 4 /*[6]*/, 102 /*[7]*/, 2400000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率6%，金券利率2%" /*[9]*/, "银券利率6%，金券利率2%" /*[10]*/, "银券利率6%，金券利率3%" /*[11]*/],
		[8 /*[0]*/, 7 /*[1]*/, 10000 /*[2]*/, 24 /*[3]*/, 10600 /*[4]*/, 100 /*[5]*/, 4 /*[6]*/, 103 /*[7]*/, 2800000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率6%，金券利率3%" /*[9]*/, "银券利率6%，金券利率3%" /*[10]*/, "银券利率7%，金券利率3%" /*[11]*/],
		[9 /*[0]*/, 8 /*[1]*/, 10000 /*[2]*/, 25 /*[3]*/, 10700 /*[4]*/, 100 /*[5]*/, 5 /*[6]*/, 103 /*[7]*/, 3200000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率7%，金券利率3%" /*[9]*/, "银券利率7%，金券利率3%" /*[10]*/, "银券利率8%，金券利率4%" /*[11]*/],
		[10 /*[0]*/, 9 /*[1]*/, 10000 /*[2]*/, 26 /*[3]*/, 10800 /*[4]*/, 100 /*[5]*/, 5 /*[6]*/, 104 /*[7]*/, 6000000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率8%，金券利率4%" /*[9]*/, "银券利率8%，金券利率4%" /*[10]*/, "银券利率9%，金券利率4%" /*[11]*/],
		[11 /*[0]*/, 10 /*[1]*/, 10000 /*[2]*/, 27 /*[3]*/, 10900 /*[4]*/, 100 /*[5]*/, 6 /*[6]*/, 104 /*[7]*/, 8000000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率9%，金券利率4%" /*[9]*/, "银券利率9%，金券利率4%" /*[10]*/, "银券利率10%，金券利率5%" /*[11]*/],
		[12 /*[0]*/, 11 /*[1]*/, 10000 /*[2]*/, 28 /*[3]*/, 11000 /*[4]*/, 100 /*[5]*/, 6 /*[6]*/, 105 /*[7]*/, 10000000 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率10%，金券利率5%" /*[9]*/, "银券利率10%，金券利率5%" /*[10]*/, "银券利率10%，金券利率5%" /*[11]*/],
		[13 /*[0]*/, 12 /*[1]*/, 10000 /*[2]*/, 30 /*[3]*/, 11000 /*[4]*/, 100 /*[5]*/, 7 /*[6]*/, 105 /*[7]*/, 0 /*[8]*/, "钱庄发行银券和金券，可供帮众投资\n当前银券利率10%，金券利率5%" /*[9]*/, "银券利率10%，金券利率5%" /*[10]*/, "无" /*[11]*/]
	],
};
