var clique_building_kongfu_data = {
		/**
	 * 0 : id, int, ID
	 * 1 : building, int, 所属建筑等级
	 * 2 : level, smallint, 等级
	 * 3 : upgrade_coins, bigint, 升级所需铜钱
	 * 4 : desc, text, 对应等级描述
	 * 5 : cur_kongfu_desc, text, 当前武功描述
	 * 6 : next_kongfu_desc, text, 下一等级武功描述 
	 */

	Id : 0,
	Building : 1,
	Level : 2,
	Upgrade_coins : 3,
	Desc : 4,
	Cur_kongfu_desc : 5,
	Next_kongfu_desc : 6,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[1 /*[0]*/, 2 /*[1]*/, 0 /*[2]*/, 300000 /*[3]*/, "建设后开启帮派内功功法研修\n升级建筑可以提升功法等级" /*[4]*/, "无" /*[5]*/, "开放吐纳心经，帮派功法等级10级" /*[6]*/],
		[2 /*[0]*/, 2 /*[1]*/, 1 /*[2]*/, 600000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级10级" /*[4]*/, "帮派功法等级10级" /*[5]*/, "帮派功法等级20级" /*[6]*/],
		[3 /*[0]*/, 2 /*[1]*/, 2 /*[2]*/, 800000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级20级" /*[4]*/, "帮派功法等级20级" /*[5]*/, "帮派功法等级30级" /*[6]*/],
		[4 /*[0]*/, 2 /*[1]*/, 3 /*[2]*/, 1000000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级30级" /*[4]*/, "帮派功法等级30级" /*[5]*/, "开放天地心法，帮派功法等级40级" /*[6]*/],
		[5 /*[0]*/, 2 /*[1]*/, 4 /*[2]*/, 1200000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级40级" /*[4]*/, "帮派功法等级40级" /*[5]*/, "帮派功法等级50级" /*[6]*/],
		[6 /*[0]*/, 2 /*[1]*/, 5 /*[2]*/, 1600000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级50级" /*[4]*/, "帮派功法等级50级" /*[5]*/, "帮派功法等级60级" /*[6]*/],
		[7 /*[0]*/, 2 /*[1]*/, 6 /*[2]*/, 2000000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级60级" /*[4]*/, "帮派功法等级60级" /*[5]*/, "帮派功法等级70级" /*[6]*/],
		[8 /*[0]*/, 2 /*[1]*/, 7 /*[2]*/, 2400000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级70级" /*[4]*/, "帮派功法等级70级" /*[5]*/, "开放无想转生，帮派功法等级80级" /*[6]*/],
		[9 /*[0]*/, 2 /*[1]*/, 8 /*[2]*/, 2800000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级80级" /*[4]*/, "帮派功法等级80级" /*[5]*/, "帮派功法等级90级" /*[6]*/],
		[10 /*[0]*/, 2 /*[1]*/, 9 /*[2]*/, 3200000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级90级" /*[4]*/, "帮派功法等级90级" /*[5]*/, "帮派功法等级100级" /*[6]*/],
		[11 /*[0]*/, 2 /*[1]*/, 10 /*[2]*/, 6000000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级100级" /*[4]*/, "帮派功法等级100级" /*[5]*/, "帮派功法等级110级" /*[6]*/],
		[12 /*[0]*/, 2 /*[1]*/, 11 /*[2]*/, 8000000 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级110级" /*[4]*/, "帮派功法等级110级" /*[5]*/, "开放无想转生，帮派功法等级120级" /*[6]*/],
		[13 /*[0]*/, 2 /*[1]*/, 12 /*[2]*/, 0 /*[3]*/, "藏有帮派内功功法典籍，可供帮众研修\n当前功法等级120级" /*[4]*/, "帮派功法等级120级" /*[5]*/, "无" /*[6]*/],
		[14 /*[0]*/, 3 /*[1]*/, 0 /*[2]*/, 300000 /*[3]*/, "建设后开启帮派外功功法研修\n升级建筑可以提升功法等级" /*[4]*/, "无" /*[5]*/, "开启凌云诀，帮派功法等级10级" /*[6]*/],
		[15 /*[0]*/, 3 /*[1]*/, 1 /*[2]*/, 600000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级10级" /*[4]*/, "帮派功法等级10级" /*[5]*/, "帮派功法等级20级" /*[6]*/],
		[16 /*[0]*/, 3 /*[1]*/, 2 /*[2]*/, 800000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级20级" /*[4]*/, "帮派功法等级20级" /*[5]*/, "帮派功法等级30级" /*[6]*/],
		[17 /*[0]*/, 3 /*[1]*/, 3 /*[2]*/, 1000000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级30级" /*[4]*/, "帮派功法等级30级" /*[5]*/, "开启混元劲，帮派功法等级40级" /*[6]*/],
		[18 /*[0]*/, 3 /*[1]*/, 4 /*[2]*/, 1200000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级40级" /*[4]*/, "帮派功法等级40级" /*[5]*/, "帮派功法等级50级" /*[6]*/],
		[19 /*[0]*/, 3 /*[1]*/, 5 /*[2]*/, 1600000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级50级" /*[4]*/, "帮派功法等级50级" /*[5]*/, "帮派功法等级60级" /*[6]*/],
		[20 /*[0]*/, 3 /*[1]*/, 6 /*[2]*/, 2000000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级60级" /*[4]*/, "帮派功法等级60级" /*[5]*/, "帮派功法等级70级" /*[6]*/],
		[21 /*[0]*/, 3 /*[1]*/, 7 /*[2]*/, 2400000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级70级" /*[4]*/, "帮派功法等级70级" /*[5]*/, "开启裂天劲，帮派功法等级80级" /*[6]*/],
		[22 /*[0]*/, 3 /*[1]*/, 8 /*[2]*/, 2800000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级80级" /*[4]*/, "帮派功法等级80级" /*[5]*/, "帮派功法等级90级" /*[6]*/],
		[23 /*[0]*/, 3 /*[1]*/, 9 /*[2]*/, 3200000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级90级" /*[4]*/, "帮派功法等级90级" /*[5]*/, "帮派功法等级100级" /*[6]*/],
		[40 /*[0]*/, 3 /*[1]*/, 10 /*[2]*/, 6000000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级100级" /*[4]*/, "帮派功法等级100级" /*[5]*/, "帮派功法等级110级" /*[6]*/],
		[25 /*[0]*/, 3 /*[1]*/, 11 /*[2]*/, 8000000 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级110级" /*[4]*/, "帮派功法等级110级" /*[5]*/, "开启剑圣心法，帮派功法等级110级" /*[6]*/],
		[26 /*[0]*/, 3 /*[1]*/, 12 /*[2]*/, 0 /*[3]*/, "藏有帮派外功功法典籍，可供帮众研修\n当前功法等级120级" /*[4]*/, "帮派功法等级120级" /*[5]*/, "无" /*[6]*/],
		[27 /*[0]*/, 4 /*[1]*/, 0 /*[2]*/, 300000 /*[3]*/, "建设后开启帮派炼体功法研修\n升级建筑可以提升功法等级" /*[4]*/, "无" /*[5]*/, "开放磐石心法，帮派功法等级10级" /*[6]*/],
		[28 /*[0]*/, 4 /*[1]*/, 1 /*[2]*/, 600000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级10级" /*[4]*/, "帮派功法等级10级" /*[5]*/, "帮派功法等级20级" /*[6]*/],
		[29 /*[0]*/, 4 /*[1]*/, 2 /*[2]*/, 800000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级20级" /*[4]*/, "帮派功法等级20级" /*[5]*/, "帮派功法等级30级" /*[6]*/],
		[30 /*[0]*/, 4 /*[1]*/, 3 /*[2]*/, 1000000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级30级" /*[4]*/, "帮派功法等级30级" /*[5]*/, "开放天罡护体，帮派功法等级40级" /*[6]*/],
		[31 /*[0]*/, 4 /*[1]*/, 4 /*[2]*/, 1200000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级40级" /*[4]*/, "帮派功法等级40级" /*[5]*/, "帮派功法等级50级" /*[6]*/],
		[32 /*[0]*/, 4 /*[1]*/, 5 /*[2]*/, 1600000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级50级" /*[4]*/, "帮派功法等级50级" /*[5]*/, "帮派功法等级60级" /*[6]*/],
		[33 /*[0]*/, 4 /*[1]*/, 6 /*[2]*/, 2000000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级60级" /*[4]*/, "帮派功法等级60级" /*[5]*/, "帮派功法等级70级" /*[6]*/],
		[34 /*[0]*/, 4 /*[1]*/, 7 /*[2]*/, 2400000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级70级" /*[4]*/, "帮派功法等级70级" /*[5]*/, "开放金刚心经，帮派功法等级80级" /*[6]*/],
		[35 /*[0]*/, 4 /*[1]*/, 8 /*[2]*/, 2800000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级80级" /*[4]*/, "帮派功法等级80级" /*[5]*/, "帮派功法等级90级" /*[6]*/],
		[36 /*[0]*/, 4 /*[1]*/, 9 /*[2]*/, 3200000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级90级" /*[4]*/, "帮派功法等级90级" /*[5]*/, "帮派功法等级100级" /*[6]*/],
		[37 /*[0]*/, 4 /*[1]*/, 10 /*[2]*/, 6000000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级100级" /*[4]*/, "帮派功法等级100级" /*[5]*/, "帮派功法等级110级" /*[6]*/],
		[38 /*[0]*/, 4 /*[1]*/, 11 /*[2]*/, 8000000 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级110级" /*[4]*/, "帮派功法等级110级" /*[5]*/, "开放九转金身，帮派功法等级120级" /*[6]*/],
		[39 /*[0]*/, 4 /*[1]*/, 12 /*[2]*/, 0 /*[3]*/, "藏有帮派炼体功法典籍，可供帮众研修\n当前功法等级120级" /*[4]*/, "帮派功法等级120级" /*[5]*/, "无" /*[6]*/]
	],
};
