var recruit_buddy_data = {
		/**
	 * 0 : id, int, ID
	 * 1 : role_id, tinyint, 角色ID
	 * 2 : init_level, smallint, 初始等级
	 * 3 : description, varchar, 描述
	 * 4 : favourite_item, smallint, 喜好品ID
	 * 5 : favourite_count, smallint, 喜好品需求量
	 * 6 : quest_id, smallint, 开启任务
	 * 7 : related_npc, int, 关联NPC 
	 * 8 : required_main_quest_order, int,以来主线任务顺序
*/


	Id : 0,
	Role_id : 1,
	Init_level : 2,
	Description : 3,
	Favourite_item : 4,
	Favourite_count : 5,
	Quest_id : 6,
	Related_npc : 7,
	Required_main_quest_order : 8,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[1 /*[0]*/, 7 /*[1]*/, 30 /*[2]*/, "初始等级30级，来自东瀛的女忍者，性格阴晴不定，擅长单体攻击" /*[3]*/, 437 /*[4]*/, 25 /*[5]*/, 47 /*[6]*/, 2 /*[7]*/, 440 /*[8]*/],
		[2 /*[0]*/, 8 /*[1]*/, 50 /*[2]*/, "初始等级50级，追求自己佛道之路的云游苦行僧" /*[3]*/, 438 /*[4]*/, 25 /*[5]*/, 109 /*[6]*/, 3 /*[7]*/, 880 /*[8]*/],
		[3 /*[0]*/, 9 /*[1]*/, 70 /*[2]*/, "初始等级70级，铸剑山庄弟子。体型强壮，肌肉发达，为人重义，秉性憨厚" /*[3]*/, 439 /*[4]*/, 25 /*[5]*/, 706 /*[6]*/, 4 /*[7]*/, 1275 /*[8]*/],
		[4 /*[0]*/, 10 /*[1]*/, 90 /*[2]*/, "初始等级90级，某秘术一族的传人，外表冷漠，少言寡语，心性却十分敏锐，博学多知，擅长冰系法术" /*[3]*/, 440 /*[4]*/, 25 /*[5]*/, 894 /*[6]*/, 5 /*[7]*/, 1670 /*[8]*/],
		[5 /*[0]*/, 11 /*[1]*/, 100 /*[2]*/, "初始等级100级，唐门公子，同辈最强者，容貌俊朗的12岁天才儿童，擅长易容、暗器、轻功" /*[3]*/, 441 /*[4]*/, 25 /*[5]*/, 1016 /*[6]*/, 6 /*[7]*/, 2080 /*[8]*/],
		[6 /*[0]*/, 5 /*[1]*/, 25 /*[2]*/, "初始等级25级，毒手药王的关门弟子，对世间百草了若指掌。性格活泼，喜欢捉弄人" /*[3]*/, 436 /*[4]*/, 10 /*[5]*/, 1127 /*[6]*/, 10 /*[7]*/, 307 /*[8]*/],
		[7 /*[0]*/, 6 /*[1]*/, 40 /*[2]*/, "初始等级40级，擅长召唤类法术，用笔绘画召唤出强大助力。给自己取名无名，认为只有无名才能专心绘画" /*[3]*/, 434 /*[4]*/, 15 /*[5]*/, 103 /*[6]*/, 9 /*[7]*/, 750 /*[8]*/],
		[8 /*[0]*/, 12 /*[1]*/, 110 /*[2]*/, "初始等级110级，来自北方的少女，手持慧伞，用以降伏魔众。性格爽利，恩怨必清" /*[3]*/, 699 /*[4]*/, 25 /*[5]*/, 1223 /*[6]*/, 11 /*[7]*/, 2550 /*[8]*/],
		[9 /*[0]*/, 16 /*[1]*/, 120 /*[2]*/, "初始等级120级，双拳打遍天下，独来独往，好打抱不平" /*[3]*/, 760 /*[4]*/, 25 /*[5]*/, 1296 /*[6]*/, 12 /*[7]*/, 2910 /*[8]*/],
		[10 /*[0]*/, 17 /*[1]*/, 130 /*[2]*/, "初始等级130级，号非凡公子，常人只道他手持折扇作武器，却不知其剑法也是当世一流" /*[3]*/, 448 /*[4]*/, 25 /*[5]*/, 1361 /*[6]*/, 13 /*[7]*/, 3235 /*[8]*/],
		[11 /*[0]*/, 18 /*[1]*/, 140 /*[2]*/, "初始等级140级，刀客南宫白夜" /*[3]*/, 443 /*[4]*/, 25 /*[5]*/, 1528 /*[6]*/, 14 /*[7]*/, 3625 /*[8]*/]
	],
};
