var taoyuan_skill_data = {
		/**
	 * 0 : id, smallint, 
	 * 1 : name, varchar, 技能名称
	 * 2 : type, tinyint, 技能类型0-酒坊，1-食坊
	 * 3 : skill_order, tinyint, 技能排序
	 * 4 : cost_item_id, smallint, 消耗物品ID
	 * 5 : cost_item_nums, smallint, 需求物品数量
	 * 6 : cost_time_percent, tinyint, 所需时间百分比
	 * 7 : need_make_times, bigint, 所需制作次数 
	 */

	Id : 0,
	Name : 1,
	Type : 2,
	Skill_order : 3,
	Cost_item_id : 4,
	Cost_item_nums : 5,
	Cost_time_percent : 6,
	Need_make_times : 7,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[1 /*[0]*/, "酿酒菜鸟" /*[1]*/, 0 /*[2]*/, 1 /*[3]*/, 7 /*[4]*/, 0 /*[5]*/, 100 /*[6]*/, 0 /*[7]*/],
		[5 /*[0]*/, "烹饪菜鸟" /*[1]*/, 1 /*[2]*/, 1 /*[3]*/, 8 /*[4]*/, 0 /*[5]*/, 100 /*[6]*/, 0 /*[7]*/],
		[2 /*[0]*/, "酿酒能手" /*[1]*/, 0 /*[2]*/, 2 /*[3]*/, 7 /*[4]*/, 1 /*[5]*/, 90 /*[6]*/, 10 /*[7]*/],
		[6 /*[0]*/, "烹饪能手" /*[1]*/, 1 /*[2]*/, 2 /*[3]*/, 8 /*[4]*/, 1 /*[5]*/, 90 /*[6]*/, 10 /*[7]*/],
		[3 /*[0]*/, "酿酒大师" /*[1]*/, 0 /*[2]*/, 3 /*[3]*/, 7 /*[4]*/, 2 /*[5]*/, 80 /*[6]*/, 50 /*[7]*/],
		[7 /*[0]*/, "烹饪大师" /*[1]*/, 1 /*[2]*/, 3 /*[3]*/, 8 /*[4]*/, 2 /*[5]*/, 80 /*[6]*/, 50 /*[7]*/],
		[4 /*[0]*/, "酒仙" /*[1]*/, 0 /*[2]*/, 4 /*[3]*/, 7 /*[4]*/, 5 /*[5]*/, 70 /*[6]*/, 100 /*[7]*/],
		[8 /*[0]*/, "厨神" /*[1]*/, 1 /*[2]*/, 4 /*[3]*/, 8 /*[4]*/, 5 /*[5]*/, 70 /*[6]*/, 100 /*[7]*/]
	],
};
