var taoyuan_product_data = {
		/**
	 * 0 : id, smallint, 
	 * 1 : item_id, smallint, 对应物品Id
	 * 2 : type, tinyint, 副产品类型0-酒坊，1-食坊
	 * 3 : need_level, smallint, 需求桃源之心等级
	 * 4 : bring_nums, smallint, 产出数量
	 * 5 : cost_item_id1, smallint, 消耗物品1
	 * 6 : cost_item_nums1, smallint, 需求物品1数量
	 * 7 : cost_item_id2, smallint, 消耗物品2
	 * 8 : cost_item_nums2, smallint, 需求物品3数量
	 * 9 : cost_item_id3, smallint, 消耗物品3
	 * 10 : cost_item_nums3, smallint, 需求物品4数量
	 * 11 : cost_item_id4, smallint, 消耗物品4
	 * 12 : cost_item_nums4, smallint, 需求物品4数量
	 * 13 : bless_weight, smallint, 愿望权重
	 * 14 : cost_time, smallint, 酿造所需时间 
	 */

	Id : 0,
	Item_id : 1,
	Type : 2,
	Need_level : 3,
	Bring_nums : 4,
	Cost_item_id1 : 5,
	Cost_item_nums1 : 6,
	Cost_item_id2 : 7,
	Cost_item_nums2 : 8,
	Cost_item_id3 : 9,
	Cost_item_nums3 : 10,
	Cost_item_id4 : 11,
	Cost_item_nums4 : 12,
	Bless_weight : 13,
	Cost_time : 14,

	Each: function(cb) {
		for(var i = 0; i < this._list.length; i++) {
			cb(this._list[i]);
		}
	},

	_list: [
		[1 /*[0]*/, 14 /*[1]*/, 0 /*[2]*/, 3 /*[3]*/, 1 /*[4]*/, 9 /*[5]*/, 6 /*[6]*/, 11 /*[7]*/, 3 /*[8]*/, 0 /*[9]*/, 0 /*[10]*/, 0 /*[11]*/, 0 /*[12]*/, 56 /*[13]*/, 1200 /*[14]*/],
		[2 /*[0]*/, 15 /*[1]*/, 0 /*[2]*/, 4 /*[3]*/, 1 /*[4]*/, 9 /*[5]*/, 6 /*[6]*/, 10 /*[7]*/, 3 /*[8]*/, 12 /*[9]*/, 3 /*[10]*/, 0 /*[11]*/, 0 /*[12]*/, 93 /*[13]*/, 1800 /*[14]*/],
		[3 /*[0]*/, 16 /*[1]*/, 0 /*[2]*/, 5 /*[3]*/, 1 /*[4]*/, 9 /*[5]*/, 9 /*[6]*/, 11 /*[7]*/, 3 /*[8]*/, 13 /*[9]*/, 3 /*[10]*/, 0 /*[11]*/, 0 /*[12]*/, 136 /*[13]*/, 2400 /*[14]*/],
		[4 /*[0]*/, 17 /*[1]*/, 1 /*[2]*/, 5 /*[3]*/, 1 /*[4]*/, 9 /*[5]*/, 9 /*[6]*/, 11 /*[7]*/, 3 /*[8]*/, 10 /*[9]*/, 6 /*[10]*/, 0 /*[11]*/, 0 /*[12]*/, 99 /*[13]*/, 1800 /*[14]*/],
		[5 /*[0]*/, 18 /*[1]*/, 1 /*[2]*/, 6 /*[3]*/, 1 /*[4]*/, 9 /*[5]*/, 9 /*[6]*/, 11 /*[7]*/, 6 /*[8]*/, 10 /*[9]*/, 3 /*[10]*/, 12 /*[11]*/, 1 /*[12]*/, 136 /*[13]*/, 2400 /*[14]*/],
		[6 /*[0]*/, 19 /*[1]*/, 1 /*[2]*/, 7 /*[3]*/, 1 /*[4]*/, 9 /*[5]*/, 9 /*[6]*/, 11 /*[7]*/, 6 /*[8]*/, 10 /*[9]*/, 6 /*[10]*/, 13 /*[11]*/, 1 /*[12]*/, 163 /*[13]*/, 3000 /*[14]*/]
	],
};
