<?php
$this->AddSQL("
delete  from clique_building_bank;
INSERT INTO `clique_building_bank` (`id`, `level`, `sliver_coupon_coins`, `sliver_coupon_num`, `sliver_coupon_sold`, `gold_coupon_coins`, `gold_coupon_num`, `gold_coupon_sold`, `upgrade`, `desc`)
VALUES
	(1, 0, 10000, 20, 10000, 0, 0, 0, 0, '建设后可发行帮派银券和金券，帮众可投资并获利\r\n升级建筑可以提升投资收益'),
	(2, 1, 10000, 20, 10200, 0, 0, 0, 500000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率2%'),
	(3, 2, 10000, 20, 10300, 0, 0, 0, 800000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率3%'),
	(4, 3, 10000, 20, 10400, 0, 0, 0, 1000000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率4%'),
	(5, 4, 10000, 21, 10500, 0, 0, 0, 1200000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率5%'),
	(6, 5, 10000, 22, 10500, 100, 10, 102, 1600000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率5%，金券利率2%'),
	(7, 6, 10000, 23, 10600, 100, 11, 102, 2000000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率6%，金券利率2%'),
	(8, 7, 10000, 24, 10600, 100, 11, 103, 2400000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率6%，金券利率3%'),
	(9, 8, 10000, 25, 10700, 100, 12, 103, 2800000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率7%，金券利率3%'),
	(10, 9, 10000, 26, 10800, 100, 12, 104, 3200000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率8%，金券利率4%'),
	(11, 10, 10000, 27, 10900, 100, 13, 104, 6000000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率9%，金券利率4%'),
	(12, 11, 10000, 28, 11000, 100, 13, 105, 8000000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率10%，金券利率5%'),
	(13, 12, 10000, 30, 11000, 100, 14, 105, 10000000, '钱庄发行银券和金券，可供帮众投资\r\n当前银券利率10%，金券利率5%');

");

$this->AddSQL("
	delete from clique_building;
	INSERT INTO `clique_building` (`id`, `name`, `biaoshi`, `desc`, `order`)
	VALUES
		(1, '宗祠', 'ZongCi', NULL, 0),
	(2, '回春堂', 'HuiChunTang', NULL, 1),
	(3, '神兵堂', 'ShenBingTang', NULL, 2),
	(4, '金刚堂', 'JinGangTang', NULL, 3);
");


$this->AddSQL("
	delete from clique_center_building_level_info;
	INSERT INTO `clique_center_building_level_info` (`id`, `level`, `max_member`, `levelup_coins`, `daily_max_coins`, `desc`)
	VALUES
		(1, 1, 20, 0, 100000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限20人，帮众每日捐献上限100000'),
	(2, 2, 22, 1000000, 150000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限22人，帮众每日捐献上限150000'),
	(3, 3, 24, 1200000, 200000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限24人，帮众每日捐献上限200000'),
	(4, 4, 26, 1600000, 250000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限26人，帮众每日捐献上限250000'),
	(5, 5, 28, 2000000, 300000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限28人，帮众每日捐献上限300000'),
	(6, 6, 30, 2400000, 400000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限30人，帮众每日捐献上限400000'),
	(7, 7, 32, 2800000, 500000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限32人，帮众每日捐献上限500000'),
	(8, 8, 34, 3200000, 600000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限34人，帮众每日捐献上限600000'),
	(9, 9, 36, 6000000, 700000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限36人，帮众每日捐献上限700000'),
	(10, 10, 38, 8000000, 800000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限38人，帮众每日捐献上限800000'),
	(11, 11, 39, 10000000, 800000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限39人，帮众每日捐献上限800000'),
	(12, 12, 40, 12000000, 800000, '帮派的中心与象征，控制整个帮派的发展\r\n当前帮众上限40人，帮众每日捐献上限800000');

");



?>

